* Integration by Substitution

** Solution 1

$\int \sin(x^2 + 3) 2x \mathrm{d}x$

We will use substitution

$u = x^2 + 3$

$\mathrm{d}u = 2x \mathrm{d}x$

This leads to the solution:

$\int \sin u \mathrm{d}u$

$= -\cos u + C$

$= -\cos (x^2 + 3) + c$

** Solution 2

$\int x^2 \sqrt[4]{x^3 - 2} \mathrm{d}x$

We will use substitution

$u = x^3 - 2$

$\mathrm{d}u = 3x^2 \mathrm{d}x$, $\dfrac{\mathrm{d}u}{3} = x^2 \mathrm{d}x$

This leads to the solution:

$\int \sqrt[4]{u} \dfrac{1}{2} \mathrm{d}u$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
(1/4) + 1
#+end_src

#+RESULTS:
: 5/4

$= \dfrac{u^{5/4}}{5/2} + C$

$= \dfrac{2*(u)^{5/4}}{5} + C$

$= \dfrac{2*(x^3 - 2)^{5/4}}{5} + C$

** Solution 3

$\int x^2 (\cos x^3) \mathrm{d}x$

We will use substitution

$u = x^3$

$\mathrm{d}u = 3x^2 \mathrm{d}x$

$\dfrac{\mathrm{d}u}{3} = x^2 \mathrm{d}x$

This leads to the solution:

$\int \dfrac{\cos u}{3} \mathrm{d}u$

$= \dfrac{\sin u}{3} + C$

$= \dfrac{\sin (x^3)}{3} + C$

** Solution 4

$\int \sin x \cos^3 x \mathrm{d}x$

We will use substitution

$u = \cos x$

$\mathrm{d}u = -\sin x \mathrm{d}x$

$-\mathrm{d}u = \sin x \mathrm{d}x$

This leads to the solution:

$\int -u^3 \mathrm{d}u$

$= \dfrac{-u^4}{4} + C$

$= \dfrac{-(\cos x)^4}{4}$

** Solution 5

$\int x^2 \sin (x^3) \cos^3 (x^3) \mathrm{d}x$

We will use substitution

$u = x^3$

$\mathrm{d}u = 3x^2 \mathrm{d}x$

$\dfrac{\mathrm{d}u}{3} = x^2 \mathrm{d}x$

This leads to the solution:

$\int \sin u \cos^3 u \dfrac{1}{3} \mathrm{d}u$

We know from solution 4, that the solution is

$= -\dfrac{\cos^4 u}{12} + C$

$= -\dfrac{\cos^4 (x^3)}{12} + C$

** Solution 6

$\int \dfrac{x \mathrm{d}x}{(x+1)^3}$

We will use substitution

Let $u = x + 1$

$\mathrm{d}u = \mathrm{d}x$

This leads to the solution:

$\int \dfrac{u-1}{u^3} \mathrm{d}u$

$= \int 1 - \dfrac{1}{u} \mathrm{d}u$

$= u - \dfrac{u^{-3+1}}{-2} + C$

$= u - \dfrac{1}{-2u^{2}} + C$

$= x + 1 - \dfrac{1}{-2(x+1)^{2}} + C$

$= x + 1 - \dfrac{1}{-2(x+1)^2} + C$

** Solution 7

$\int \dfrac{\mathrm{d}x}{\sqrt{x}(\sqrt{x} + 1)^4}$

We will use substitution

Let $u = \sqrt{x} + 1$

$\mathrm{d}u =  \dfrac{-1}{2*\sqrt{x}} dx$

$\dfrac{-2*du}{1} = \dfrac{1}{\sqrt{x}} dx$

This leads to the solution:

$\int \dfrac{-2*du}{(u)^4}$

$= \dfrac{-2*u^{-3}}{-3} + C$

$= \dfrac{-2}{3(\sqrt{x} + 1)^3} + C$

** Solution 8

$\int \dfrac{\sqrt{x} dx}{(\sqrt{x} + 1)^4}$

We will use substitution

Let $u = \sqrt{x}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
diff(sqrt(x), x).expand()
#+end_src

#+RESULTS:
: 1/2/sqrt(x)

$du = \dfrac{1}{2*\sqrt{x}} dx$

$du = \dfrac{\sqrt{x}}{2*x} dx$

$\dfrac{du}{2x} = \sqrt{x} dx$

This leads to the solution:

$\int \dfrac{2x du}{(u + 1)^4}$

$= \int \dfrac{2u^2 du}{(u+1)^4}$

$= \int \dfrac{2u^2 du}{u^4(1 + 1/u)^4}$

$= \int \dfrac{2 du}{u^2(1+1/u)^4}$

Let $n = \dfrac{1}{u}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
u = var('u')
diff(1/u, u).expand()
#+end_src

#+RESULTS:
: -1/u^2

$dn = -\dfrac{1}{u^2} du$

$-dn = dfrac{1}{u^2} du$

$= \int \dfrac{-dn}{(1 + n)^4}$

$= \int \dfrac{-1}{(1+n)^4} dn$

Let $k = 1 + n$

$dk = dn$

$= \int \dfrac{-1}{k^4} dk$

$= \dfrac{-k^{-3}}{-3}$

$= \dfrac{1}{3k^3}$

$= \dfrac{1}{3(1+n)^3}$

$= \dfrac{1}{3(1+(1/u))^3}$

$= \dfrac{1}{3(1+(1/\sqrt{x}))^3}$

** Solution 9

$\int \sec^2 x \tan^2 x dx$

We will use substitution

We know that $\tan^2 x = \sec^2 x - 1$

$\int (\tan^2 x + 1)\tan^2 x dx$

We know that

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
diff(tan(x), x)
#+end_src

#+RESULTS:
: tan(x)^2 + 1

Let $u = \tan x$

$du = \tan^2 x + 1 dx$

$\int u^2 du$

$\dfrac{u^3}{3} + C$

$\dfrac{\tan^3 x}{3} + C$

** Solution 10

$\int \sqrt{1 + \sin x} \cos x dx$

We will use substitution

Let $u = 1 + \sin x$

$du = \cos x dx$

$\int \sqrt{u} du$

$\dfrac{u^{3/2}}{3/2} + C$

$2 \dfrac{(1+\sin x)^(3/2)}{3} + C$

** Solution 11

$\int_0^4 \dfrac{x dx}{\sqrt{x^2 + 9}}$

Let's evaluate the indefinite integral.

We will use substitution

Let $u = x^2 + 9$

$du = 2x dx$

$\dfrac{du}{2} = x dx$

$\int \dfrac{1}{2*\sqrt{u}} du$

$= \sqrt{u} + C$

$= \sqrt{x^2 + 9} + C$

From theorem 5.4.3,

$\int_0^4 \dfrac{x dx}{\sqrt{x^2 + 9}} = \sqrt{4^2 + 9} - \sqrt{4^2 + 9}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
f = sqrt(x^2 + 9)
f(4) - f(0)
#+end_src

#+RESULTS:
: 2

** Solution 12

$\int_0^1 (x+1)(x^2 + 2x - 1)^4 dx$

Let's evaluate the indefinite integral.

We will use substitution

Let $u = x^2 + 2x - 1$

$du = 2x + 2 dx$

$\dfrac{du}{2} = (x+1) dx$

$\int \dfrac{u du}{2}$

$= \dfrac{u^2}{4} + C$

$= \dfrac{(x^2 + 2x - 1)^2}{4} + C$

From theorem 5.4.3,

$\int_0^1 (x+1)(x^2 + 2x - 1)^4 dx = \dfrac{(1^2 + 2 - 1)^2}{4} - \dfrac{(0^2 + 0 - 1)^2}{4}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
f = ((x^2 + 2*x - 1)^2)/4
f(1) - f(0)
#+end_src

#+RESULTS:
: 3/4

** Solution 13

$\int_0^{\pi/3} \sec^3 x \tan x dx$

We know that:

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
diff(sec(x))
#+end_src

#+RESULTS:
: sec(x)*tan(x)

Let's evaluate the indefinite integral.

We will use substitution

Let $u = \sec x$

$du = \sec x \tan x dx$

$\int u^2 du$

$= \dfrac{u^3}{3} + C$

$= \dfrac{(\sec x)^3}{3} + C$

From theorem 5.4.3,

$\int_0^{\pi/3} \sec^3 x \tan x dx = \dfrac{(\sec (\pi/3))^3}{3} - \dfrac{(\sec 0)^3}{3}$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
f = ((sec(x))^3)/3
f(pi/3) - f(0)
#+end_src

#+RESULTS:
: 7/3

** Solution 14

$\int_{\pi^2}{4\pi^2} \dfrac{\cos (\sqrt{x}/4)}{\sqrt{x}} dx$

We know that:

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
diff((sqrt(x)), x)
#+end_src

#+RESULTS:
: 1/2/sqrt(x)

Let's evaluate the indefinite integral.

We will use substitution

Let $u = \dfrac{\sqrt{x}}{4}$

$8 du = \dfrac{1}{\sqrt{x}} dx$

$\int 8 \cos (u) du$

$= -8\sin u + C$

$= -8\sin (\dfrac{\sqrt{x}}{4}) + C$

From theorem 5.4.3,

$\int_{\pi^2}{4\pi^2} \dfrac{\cos (\sqrt{x}/4)}{\sqrt{x}} dx = -8\sin (\dfrac{\sqrt{4\pi^2}}{4}) + -8\sin (\dfrac{\sqrt{\pi^2}}{4})$

#+begin_src sage :session nix :eval never-export :results value verbatim output :exports both
x = var('x')
f = -8*sin(sqrt(x)/4)
f(4*(pi^2)) - f(pi^2)
#+end_src

#+RESULTS:
: 4*sqrt(2) - 8

** Solution 15

$\int \dfrac{\sin^2 x}{\cos^2 x} dx$

We know that $\sin^2 x = 1 - \cos^2 x$

$= \int \dfrac{1 - \cos^2 x}{\cos^2 x} dx$

$= \int \dfrac{1}{\cos^2 x} dx - \int 1 dx$

$= \int \sec^2 x dx - \int 1 dx$

$= \tan x - x + C$
